pandas day1

In [1]:
import pandas as pd

In [15]:
data={
    "name":["Shree","Gayatri","Yash"],
    "age":[20,19,25],
    "loc":["jalgaon","Sambhaji_nagar","nashik"]
}

In [16]:
df=pd.DataFrame(data)

In [17]:
df.set_index('age', inplace=True)

In [18]:
df

        name             loc
age
20     Shree         jalgaon
19   Gayatri  Sambhaji_nagar
25      Yash          nashik

In [5]:
data1= [["Shree","Gayatri","Yash"],
    [20,19,25],
    ["jalgaon","Sambhaji_nagar","nashik"]]

In [7]:
df1=pd.DataFrame(data1,columns=["Name","Age","City"])

In [8]:
df1

      Name             Age    City
0    Shree         Gayatri    Yash
1       20              19      25
2  jalgaon  Sambhaji_nagar  nashik

In [19]:
df=pd.read_csv("dog.csv")

In [20]:
df

,HALTER_ID,ALTER,GESCHLECHT,STADTKREIS,STADTQUARTIER,RASSE1,RASSE1_MISCHLING,RASSE2,RASSE2_MISCHLING,RASSENTYP,GEBURTSJAHR_HUND,GESCHLECHT_HUND,HUNDEFARBE
0,126,51-60,m,9.0,92.0,Welsh Terrier,NaN,NaN,NaN,K,2011,w,schwarz/braun
1,574,61-70,w,2.0,23.0,Cairn Terrier,NaN,NaN,NaN,K,2002,w,brindle
2,695,41-50,m,6.0,63.0,Labrador Retriever,NaN,NaN,NaN,I,2012,w,braun
3,893,61-70,w,7.0,71.0,Mittelschnauzer,NaN,NaN,NaN,I,2010,w,schwarz
4,1177,51-60,m,10.0,102.0,Shih Tzu,NaN,NaN,NaN,K,2011,m,schwarz/weiss
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6975,128471,21-30,w,8.0,83.0,Tibetan Spaniel,NaN,NaN,NaN,K,2007,w,braun/beige
6976,128471,21-30,w,8.0,83.0,Rottweiler,NaN,NaN,NaN,I,2014,m,schwarz/rot
6977,128479,51-60,w,6.0,63.0,Lagotto Romagnolo,Mischling,NaN,NaN,I,2007,m,weiss/grau
6978,128482,21-30,w,9.0,91.0,Yorkshire Terrier,NaN,NaN,NaN,K,2015,w,schwarz/braun/grau
6979,128485,21-30,w,7.0,74.0,Magyar Viszla,NaN,NaN,NaN,I,2014,w,gelb

In [21]:
df['ALTER']

0       51-60
1       61-70
2       41-50
3       61-70
4       51-60
        ...
6975    21-30
6976    21-30
6977    51-60
6978    21-30
6979    21-30
Name: ALTER, Length: 6980, dtype: object

In [25]:
df[["HALTER_ID","STADTKREIS"]]

      HALTER_ID  STADTKREIS
0           126         9.0
1           574         2.0
2           695         6.0
3           893         7.0
4          1177        10.0
...         ...         ...
6975     128471         8.0
6976     128471         8.0
6977     128479         6.0
6978     128482         9.0
6979     128485         7.0

[6980 rows x 2 columns]

In [28]:
df.loc[78]

HALTER_ID           23889
ALTER               61-70
GESCHLECHT              w
STADTKREIS            4.0
STADTQUARTIER        42.0
RASSE1              Pudel
RASSE1_MISCHLING      NaN
RASSE2                NaN
RASSE2_MISCHLING      NaN
RASSENTYP             NaN
GEBURTSJAHR_HUND     2012
GESCHLECHT_HUND         m
HUNDEFARBE          braun
Name: 78, dtype: object

In [30]:
data={
    "name":["Shree","Gayatri","Yash"],
    "age":[20,19,25],
    "loc":["jalgaon","Sambhaji_nagar","nashik"]
}
df=pd.DataFrame(data)
df.set_index('name',inplace=True)

In [31]:
df

         age             loc
name
Shree     20         jalgaon
Gayatri   19  Sambhaji_nagar
Yash      25          nashik

In [32]:
df.loc['Yash']

age        25
loc    nashik
Name: Yash, dtype: object

In [33]:
df.iloc[1]

age                19
loc    Sambhaji_nagar
Name: Gayatri, dtype: object

In [34]:
df.head()  # First 5 rows
df.tail()  # Last 5 rows
df.info()  # Summary of the DataFrame
df.describe()  # Summary statistics of numerical columns

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Shree to Yash
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int64
 1   loc     3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

             age
count   3.000000
mean   21.333333
std     3.214550
min    19.000000
25%    19.500000
50%    20.000000
75%    22.500000
max    25.000000

In [35]:
df['gender']=["male","female","male"]

In [36]:
df

         age             loc  gender
name
Shree     20         jalgaon    male
Gayatri   19  Sambhaji_nagar  female
Yash      25          nashik    male

In [37]:
df.drop(columns=['gender'],inplace=True)

In [38]:
df

         age             loc
name
Shree     20         jalgaon
Gayatri   19  Sambhaji_nagar
Yash      25          nashik

In [39]:
df[df['age'] >19]

       age      loc
name
Shree   20  jalgaon
Yash    25   nashik

In [40]:
df

         age             loc
name
Shree     20         jalgaon
Gayatri   19  Sambhaji_nagar
Yash      25          nashik

In [43]:
# df.loc["Gayatri",'age']=56
df.loc[["Gayatri","Shree"],'age']=[56,58]

In [44]:
df

         age             loc
name
Shree     58         jalgaon
Gayatri   56  Sambhaji_nagar
Yash      25          nashik

In [55]:
data={
    "name":["Shree","Gayatri","Yash"],
    "age":[20,19,25],
    "loc":["jalgaon","Sambhaji_nagar","nashik"]
}
df=pd.DataFrame(data)
# df.set_index('name',inplace=True)

In [56]:
df

      name  age             loc
0    Shree   20         jalgaon
1  Gayatri   19  Sambhaji_nagar
2     Yash   25          nashik

In [57]:
df.iloc[0,1]=21

In [58]:
df

      name  age             loc
0    Shree   21         jalgaon
1  Gayatri   19  Sambhaji_nagar
2     Yash   25          nashik

In [64]:
df.iloc[0:2,2]=["Noida","mumbai"]

In [65]:
df

      name  age     loc
0    Shree   21   Noida
1  Gayatri   19  mumbai
2     Yash   25    pune

In [66]:
# df.set_index("name",inplace=True)

In [67]:
df

         age     loc
name
Shree     21   Noida
Gayatri   19  mumbai
Yash      25    pune

In [68]:
df.at["Gayatri","age"]=99

In [69]:
df

         age     loc
name
Shree     21   Noida
Gayatri   99  mumbai
Yash      25    pune

In [70]:
df.iat[0,0]=77

In [71]:
df

         age     loc
name
Shree     77   Noida
Gayatri   99  mumbai
Yash      25    pune